import Menu from '../../../components/Menu';
import Pic from '../../../assets/images/roadMap/bigPlate.png';
import Pic2 from '../../../assets/images/roadMap/sec2pic2.png';
import Pic3 from '../../../assets/images/roadMap/sec2pic3.png';
import { Link } from 'react-router-dom';
//
// ────────────────────────────────────────────────────────── I ──────────
//   :::::: C O M P O N E N T : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────
//

export default function Index() {
  // ─── Global Variable ────────────────────────────────────────────────────────────

  // ─── States ─────────────────────────────────────────────────────────────────────

  // ─── Life Cycle ─────────────────────────────────────────────────────────────────

  // ─── Functions ──────────────────────────────────────────────────────────────────

  //
  // ──────────────────────────────────────────────────── I ──────────
  //   :::::: R E N D E R : :  :   :    :     :        :          :
  // ──────────────────────────────────────────────────────────────
  //
  return (
    <>
      <Menu/>
      <section className="roadMapWrapper">
      <section className="section2">
        <section className="header">
          <span className="levelNumber">2</span>
          <span className="text mr-10">
            غذای سالم
            <br />
            به بهترین شکل زندگی خودت برس!
          </span>
          <img src={Pic} alt="" />
        </section>
        <section className="grid grid-cols-2 gap-2 mt-32 px-36">
          <section className='flex justify-start items-center'>
            <img src={Pic2} alt="" className="bigPicture" />
          </section>
          <section className="flex flex-col	 justify-center">
            <h2>1. به بهترین شکل زندگی خودت برس!</h2>
            <p className="mt-4">
              می خوای سالم غذا بخوری؟ کاهش وزن؟ سوزاندن چربی؟ افزایش وزن ؟ عضله
              سازی؟ با این همه مشکلات موجود، بادینس اینجاست تا با استفاده از علم،
              همه چیو درست کنه. اینجا حقایقی در مورد تغذیه آورده شده که برای شروع
              بدون توجه به هدف شما باید بداونید. حرف‌های زیادی برای گفتن وجودداره،
              اما اینها اصول اولیه‌ای هستن که همه باید قبل از تصمیم‌گیری درباره
              رژیم غذایی خودشون بدونن.
            </p>
          </section>
        </section>
        <section className="grid grid-cols-2 gap-2 mt-32 px-36">
          <section className="flex flex-col	 justify-center">
            <h2>2. به بهترین شکل زندگی خودت برس!</h2>
            <p className="mt-4">
              ما انرژی را بر حسب کالری (کیلو کالری) اندازه گیری می کنیم و بدن ما
              عمدتاً از سه منبع دریافت می کنه:
            </p>
            <p>
              <strong>کربوهیدرات ها: </strong>
              به عنوان قند; شناخته می شود. به اشکال مختلف یافت می شه. 1 گرم
              کربوهیدرات حاوی 4 کالری انرژیه
            </p>
            <p>
              <strong>چربی ها: </strong>
              به عنوان لیپید; شناخته می شه. 1 گرم چربی حاوی 9 کالری انرژیه.
            </p>
            <p>
              <strong>پروتئین : </strong>
              از بلوک های ساختمانی به نام اسیدهای آمینه ساخته شده. 1 گرم پروتئین
              حاوی 4 کالری انرژیه.
            </p>
            <p>
              این سه منبع انرژی در دنیای تناسب اندام هستند که به عنوان درشت مغذی
              ها یا <strong>ماکروها</strong>; شناخته می شوند. کالری هایی ه از
              ماکروهای خود دریافت می کنید به عنوان ;سوخت; توسط بدن استفاده می شود.
              اگر کالری بیش از حد دریافت کنید، بدن شما باقیمانده آن را معمولاً به
              صورت چربی در زیر پوست و کربوهیدرات در کبد و ماهیچه ها «ذخیره» می
              کند. بدن ما در واقع می‌تواند کربوهیدرات‌ها را به چربی، چربی‌ها را به
              کربوهیدرات، پروتئین را به کربوهیدرات و کربوهیدرات‌ها را به مقداری
              پروتئین تبدیل کند، و انرژی را در هر تصمیمی که مهم باشد ذخیره می‌کند.
            </p>
          </section>
          <section className="flex justify-end items-center">
            <img src={Pic3} className="bigPicture" alt="" />
          </section>
        </section>
        <section className='mt-10 px-36'>
          <h2>3- کالری ها وزن شما را کنترل می کنند همیشه!</h2>
          <p>وقتی نوبت به وزن شما می رسه، مهم نیست که چه تعداد غذای "سالم" در رژیم غذایی خود داری: خوردن کالری بیشتر از آنچه بدن شما مصرف می کنه، مازاد کالری نامیده می شه و منجر به افزایش وزن می شه. خوردن کالری کمتر از آنچه بدن شما مصرف می کنه، کمبود کالری نامیده می شه و منجر به کاهش وزن می شه.</p>
        </section>
        <Link className='letsGoBtn' to="/basicInfo">امروز شروع کن</Link>
      </section>
    </section>
    </>
    

  );
}
